{
    "fr": {
        "le_casseur_codes": "Le Casseur des <b>Codes</b>",
        "presentation": "A propos de moi",
        "ma_presentation_1": "Salut, je suis Idriss, j'ai ",
        "ma_presentation_2": "Je suis passionné par le développement. </br> Créer des choses a partir de code c’est tellement satisfaisant.",
        "extra_about_me": "J’espère pouvoir transmettre mon enthousiasme à travers mes créations !",
        "this_is_me": "Salut !",
        "wip": "Ce site web est en cours de développement",
        "title_about_this_site": "A propos de cette page web",
        "about_this_site_1": "Cette page web est implémenté et modifié au fur et à mesure que j'ai appris des choses sur les bases de la création d'un site internet.",
        "about_this_site_2": "Le changement de langue a été fait avec du javascript et du JSON. </br>Il y a des meilleures manières de le faire ! Mais j'ai commencé avec cette idée et j'ai décidé de l'assumer jusqu'au bout.",
        "mon_parcours": "Mon <br>Parcours",
        "accueil": "Accueil",
        "other_links": "Mes <br>Liens",
        "formation_title": "Formations",
        "profession_title": "Professions",
        "mon_parcours_title1": "Il était une fois...",
        "mon_parcours_title2": "Une personne doit être cool...",
        "mon_parcours_title3": "Devenir ingénieur en optique...",
        "mon_parcours_title4": "Développer des jeux vidéo seul ...",
        "mon_parcours_title5": "Un développeur web passionné et prêt à relever les défis du monde numérique.",
        "text_parcours1": "J'ai toujours été attiré par la curiosité de comprendre comment les choses fonctionnent en harmonie. Étant passionné, dès le plus jeune âge, par les jeux vidéo, il était naturel de vouloir savoir pourquoi et comment ce média fonctionne. Je me souviens de la réponse de ma conseillère d'orientation en 6ème, qui m'a dit que je devrais devenir 'programmeur de jeux vidéo' et poursuivre un bac S. Quand j'ai eu accès à internet, j'ai enfin pu mettre la main sur des logiciels comme 'RPG Maker', qui comprenaient des scripts Ruby, bien trop compliqués pour moi à l'époque. Je me contentais d'utiliser leurs systèmes d'événements. C'était en tout cas un bon premier pas pour comprendre la logique du développement d'applications.",
        "text_parcours2": "Le seul hic était que le développement et le numérique n'étaient pas des sujets cools que l'on pouvait vraiment partager ou mettre en avant. J'étais extrêmement réservé sur ce sujet, et je le cachais. Les professeurs m'ont suggéré de ne pas poursuivre un cursus scientifique pur, mais plutôt technique. Suivre une carrière dans le développement n'était désormais plus une réalité ; je me devais de suivre une voie qui m'intéresse. La physique m'a toujours plu, et la théorie de la lumière (ainsi que l'optique en général) a facilement réussi à raviver mon intérêt pour poursuivre des études. Pendant le lycée, j'ai donc suivi une filière technique de laboratoire spécialisée en optique. Cependant, cela ne m'a jamais empêché, pendant mon temps libre, de m'intéresser au développement. Mon ami et moi faisions des vidéos Youtube, timidement, j'ai mis à disposition mes compétences et créé un site en intégrant des blocs Flash qui parcouraient nos vidéos YouTube. Je me souviens payer le nom de domaine en cliquant sur des publicités dans mes mails.",
        "text_parcours3": "Avec le baccalauréat en poche, j'étais déterminé à me spécialiser dans le domaine de l'optique, en mettant l'accent sur les technologies holographiques. Je suivais de près les progrès technologiques susceptibles de permettre la création d'informations virtuelles dans notre espace réel. Ainsi, j'ai suivi le cursus pour obtenir un brevet de technicien supérieur en optique photonique. Mes résultats étaient suffisants pour entamer un apprentissage en tant qu'ingénieur en optique. Cependant, de nombreuses circonstances ont contribué à l'échec de cette expérience à Paris en tant qu'apprenti ingénieur ; mon cœur n'y était pas. La flamme qui m'animait s'était éteinte, remettant en question mes ambitions... Je ne voulais solliciter l'aide de personne, et donc, je me suis isolé.",
        "text_parcours4": "J'ai décidé de me former de manière autodidacte et de me lancer dans la création de jeux vidéo. J'ai commencé à apprendre le langage JavaScript avec le moteur de jeu Unity, mais la majorité de la communauté utilisait le langage C#. En suivant des créateurs anglais sur YouTube, j'ai acquis des compétences en C# et dans le développement sur Unity. Cependant, le manque 'd'assets' adapté à mon code suscitait beaucoup de frustration. L'incapacité à produire des résultats satisfaisants n'a fait qu'aggraver ma dépression. Mon isolement et ma persistance à vouloir me débrouiller seul m'ont aveuglé sur ma situation.",
        "text_parcours5": "Il est temps de sortir de ma bulle et de me rendre utile. Je suis immergé dans le monde numérique et je suis de près les tendances en matière de développement et du numérique. La question à laquelle je devais répondre était : comment puis-je mettre à profit ce que j'ai appris ? La réponse évidente est le développement web. Jamais je n'aurais découvert cette inclination si je n'avais pas demandé de l'aide. Après ma formation, j'ai retrouvé cette passion qui m'animait, et je suis déterminé à devenir un développeur web compétent et innovant.",
        "text_creation_1": "Voici ma création... ",
        "text_creation_2": "Ca c'est la deuxième chose que j'ai faite... ",
        "text_link_1": "Mes liens : ",
        "text_link_2": "<a href='https://linktr.ee/balidriss'>Link</a>",
        "news 1": "03/09 Nouvelle démo disponible ! Rends-toi dans 'mes liens'.",
        "news 2": "Inscris-toi à la newsletter !",
        "bouton_newsletter": "S'abonner à la newsletter"
    },
    "en": {
        "le_casseur_codes": "The <b>Code</b> Breaker",
        "presentation": "About me",
        "ma_presentation_1": "Hi, my name is Idriss, I'm ",
        "ma_presentation_2": "I'm passionate about development.",
        "extra_about_me": "Making things from codes is so satisfying, and I hope I can convey my enthusiasm through my creations !",
        "this_is_me": "Hello !",
        "wip": "This website is a work in progress.",
        "title_about_this_site": "About this webpage",
        "about_this_site_1": "This webpage has been implemented and modified as I learned about the basics of making a website.",
        "about_this_site_2": "The language change was done with javascript and JSON. </br>There are better ways to do it, but this is how I started and I decided to stick with it until the end.",
        "mon_parcours": "My <br>Background",
        "accueil": "Home",
        "other_links": "My <br>Links",
        "formation_title": "Courses",
        "profession_title": "Professions",
        "mon_parcours_title1": "Once upon a time...",
        "mon_parcours_title2": "Someone must be cool...",
        "mon_parcours_title3": "To become an optical engineer ...",
        "mon_parcours_title4": "Making video games alone ...",
        "mon_parcours_title5": "A passionate web developer ready to take on the challenges of the digital world.",
        "text_parcours1": "I have always been drawn to the curiosity of understanding how things work in harmony. Being passionate about video games from a young age, it was natural to want to know why and how this media functions. I remember my career counselor's response in 6th grade, telling me that I should become a 'video game programmer' and pursue a science-oriented curriculum. When I gained access to the internet, I was finally able to get my hands on software like 'RPG Maker,' which included Ruby scripts, way too complicated for me at the time. I contented myself with using their event systems. It was, in any case, a good first step to understand the logic of application development.",
        "text_parcours2": "The only drawback was that development and digital technology weren't the cool things to share or boast about. I was extremely reserved when it came to this subject, and I kept it hidden. Teachers suggested that I do not pursue a purely scientific curriculum but rather a technical one. Following a career in development was no longer a reality; I had to follow a path that interested me. Physics always appealed to me, and the theory of light (as well as optics in general) easily reignited my interest in pursuing studies. During high school, I therefore pursued a technical laboratory program specializing in optics. However, this didn't stop me, in my free time, from being interested in development. Because with my friend we were making youtube video, timidly, I made my skills available and created a website by integrating Flash blocks that showcased our YouTube videos, which were initialy displayed on Skyblog. I remember paying for the domain name by clicking on advertisements in my emails.",
        "text_parcours3": "With my high school diploma in hand, I was determined to specialize in the field of optics, particularly focusing on holographic technologies. I closely followed technological advancements that could enable the creation of virtual information in our real space. Consequently, I pursued the program to obtain an Advanced Technician's Certificate in photonics optics. My results were sufficient to embark on an apprenticeship as an optical engineer. However, various circumstances led to the failure of this experience in Paris as an engineering apprentice; my heart wasn't in it. The passion that once fueled me had extinguished, prompting a reevaluation of my ambitions... I didn't want to seek help from anyone, so I isolated myself.",
        "text_parcours4": "I decided to self-train and develop video games. I started learning JavaScript with the Unity game engine, but the majority of the community uses the C# language. By following English creators on YouTube, I learned C# and how to develop on Unity. However, when things started working, the lack of custom assets created a lot of frustration. The inability to create satisfying results only fueled my depression. This isolation and the pursuit of trying to handle everything on my own blinded me to the situation I was in.",
        "text_parcours5": "It's time to break out of my bubble and make myself useful. I'm deeply involved in the digital world, closely following trends in development and technology. The question I had to answer was: how can I leverage what I've learned? The obvious answer is web development. I would have never found this inclination if I hadn't sought help. After my training, I rediscovered the passion that drove me, and I am determined to become a skilled and innovative web developer.",
        "text_creation_1": "This is what I made...",
        "text_creation_2": "This is the second thing I did...",
        "text_link_1": " My Links : ",
        "text_link_2": "<a href='https://linktr.ee/balidriss'>Link</a> ",
        "news 1": "03/09 New demo available ! Find it in 'Links'.",
        "news 2": "Subscribe to the newsletter !",
        "bouton_newsletter": "Subscribe to newsletter"
    }
}